#### Terraform Format and Style 🖌`failure`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>
```

Success! The configuration is valid.


```
</details>
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>
```

terraform
Acquiring state lock. This may take a few moments...
data.archive_file.functions_src: Reading...
data.archive_file.functions_src: Read complete after 0s [id=d6f42c29508113918e256538b286e5db5805d412]
google_project.default: Refreshing state... [id=projects/colomney-my-pet-melody-dev]
google_service_account.cloud_tasks: Refreshing state... [id=projects/colomney-my-pet-melody-dev/serviceAccounts/cloud-tasks@colomney-my-pet-melody-dev.iam.gserviceaccount.com]
google_project_service.default["cloudtasks.googleapis.com"]: Refreshing state... [id=colomney-my-pet-melody-dev/cloudtasks.googleapis.com]
google_project_service.default["identitytoolkit.googleapis.com"]: Refreshing state... [id=colomney-my-pet-melody-dev/identitytoolkit.googleapis.com]
google_project_service.default["firebaserules.googleapis.com"]: Refreshing state... [id=colomney-my-pet-melody-dev/firebaserules.googleapis.com]
google_project_service.default["cloudfunctions.googleapis.com"]: Refreshing state... [id=colomney-my-pet-melody-dev/cloudfunctions.googleapis.com]
google_project_service.default["cloudbuild.googleapis.com"]: Refreshing state... [id=colomney-my-pet-melody-dev/cloudbuild.googleapis.com]
google_project_service.default["iamcredentials.googleapis.com"]: Refreshing state... [id=colomney-my-pet-melody-dev/iamcredentials.googleapis.com]
google_project_service.default["firebase.googleapis.com"]: Refreshing state... [id=colomney-my-pet-melody-dev/firebase.googleapis.com]
google_project_service.default["cloudresourcemanager.googleapis.com"]: Refreshing state... [id=colomney-my-pet-melody-dev/cloudresourcemanager.googleapis.com]
google_project_service.default["sts.googleapis.com"]: Refreshing state... [id=colomney-my-pet-melody-dev/sts.googleapis.com]
google_project_service.default["cloudbilling.googleapis.com"]: Refreshing state... [id=colomney-my-pet-melody-dev/cloudbilling.googleapis.com]
google_project_iam_member.cloud_tasks_enqueuer: Refreshing state... [id=colomney-my-pet-melody-dev/roles/cloudtasks.enqueuer/serviceAccount:cloud-tasks@colomney-my-pet-melody-dev.iam.gserviceaccount.com]
google_firestore_database.default: Refreshing state... [id=projects/colomney-my-pet-melody-dev/databases/(default)]
google_project_service.default["serviceusage.googleapis.com"]: Refreshing state... [id=colomney-my-pet-melody-dev/serviceusage.googleapis.com]
google_project_service.default["firebasestorage.googleapis.com"]: Refreshing state... [id=colomney-my-pet-melody-dev/firebasestorage.googleapis.com]
google_project_service.default["firestore.googleapis.com"]: Refreshing state... [id=colomney-my-pet-melody-dev/firestore.googleapis.com]
google_project_service.default["iam.googleapis.com"]: Refreshing state... [id=colomney-my-pet-melody-dev/iam.googleapis.com]
google_firebaserules_ruleset.firestore: Refreshing state... [id=projects/colomney-my-pet-melody-dev/rulesets/4faa8455-a31e-4ffc-a828-ffd63326366c]
google_app_engine_application.default: Refreshing state... [id=colomney-my-pet-melody-dev]
google_firebase_storage_bucket.default: Refreshing state... [id=projects/colomney-my-pet-melody-dev/buckets/colomney-my-pet-melody-dev.appspot.com]
google_firebaserules_release.firestore: Refreshing state... [id=projects/colomney-my-pet-melody-dev/releases/cloud.firestore]
google_firebase_project.default: Refreshing state... [id=projects/colomney-my-pet-melody-dev]
google_iam_workload_identity_pool.github: Refreshing state... [id=projects/colomney-my-pet-melody-dev/locations/global/workloadIdentityPools/github]
google_cloud_tasks_queue.default: Refreshing state... [id=projects/colomney-my-pet-melody-dev/locations/asia-east1/queues/colomney-my-pet-melody-dev-service]
google_identity_platform_config.auth: Refreshing state... [id=projects/colomney-my-pet-melody-dev/config]
google_service_account_iam_member.as_deploy_service_account: Refreshing state... [id=projects/colomney-my-pet-melody-dev/serviceAccounts/deploy-functions-from-github@colomney-my-pet-melody-dev.iam.gserviceaccount.com/roles/iam.workloadIdentityUser/principalSet://iam.googleapis.com/projects/409733918350/locations/global/workloadIdentityPools/github/attribute.repository/shotaIDE/my-pet-melody]
google_iam_workload_identity_pool_provider.myprovider: Refreshing state... [id=projects/colomney-my-pet-melody-dev/locations/global/workloadIdentityPools/github/providers/my-pet-melody]
google_firebase_android_app.default: Refreshing state... [id=projects/colomney-my-pet-melody-dev/androidApps/1:409733918350:android:6e0ef3847f6f80a7fea3df]
google_firebase_apple_app.default: Refreshing state... [id=projects/colomney-my-pet-melody-dev/iosApps/1:409733918350:ios:e1fc95560330d3dbfea3df]
google_firebaserules_ruleset.storage: Refreshing state... [id=projects/colomney-my-pet-melody-dev/rulesets/886253d9-bdb6-434b-aca3-29e55d1debb0]
google_storage_bucket.deploy: Refreshing state... [id=colomney-my-pet-melody-dev-deploy]
google_firebaserules_release.storage: Refreshing state... [id=projects/colomney-my-pet-melody-dev/releases/firebase.storage/colomney-my-pet-melody-dev.appspot.com]
google_storage_bucket_object.functions_src: Refreshing state... [id=colomney-my-pet-melody-dev-deploy-functions/src_4885636eb3880d04058b52141791bd1a.zip]
google_cloudfunctions_function.submit: Refreshing state... [id=colomney-my-pet-melody-dev/asia-east1/submit]
google_cloudfunctions_function.piece: Refreshing state... [id=colomney-my-pet-melody-dev/asia-east1/piece]
google_cloudfunctions_function.detect: Refreshing state... [id=colomney-my-pet-melody-dev/asia-east1/detect]
google_cloudfunctions_function_iam_member.piece_invoker: Refreshing state... [id=projects/colomney-my-pet-melody-dev/locations/asia-east1/functions/piece/roles/cloudfunctions.invoker/allUsers]
google_cloudfunctions_function_iam_member.detect_invoker: Refreshing state... [id=projects/colomney-my-pet-melody-dev/locations/asia-east1/functions/detect/roles/cloudfunctions.invoker/allUsers]
google_cloudfunctions_function_iam_member.submit_invoker: Refreshing state... [id=projects/colomney-my-pet-melody-dev/locations/asia-east1/functions/submit/roles/cloudfunctions.invoker/allUsers]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # google_cloudfunctions_function.detect will be updated in-place
  ~ resource "google_cloudfunctions_function" "detect" {
        id                            = "colomney-my-pet-melody-dev/asia-east1/detect"
        name                          = "detect"
      ~ source_archive_object         = "functions/src_4885636eb3880d04058b52141791bd1a.zip" -> "functions/src_0187bbf944d724b51622cb2525998ad1.zip"
        # (27 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # google_cloudfunctions_function.piece will be updated in-place
  ~ resource "google_cloudfunctions_function" "piece" {
        id                            = "colomney-my-pet-melody-dev/asia-east1/piece"
        name                          = "piece"
      ~ source_archive_object         = "functions/src_4885636eb3880d04058b52141791bd1a.zip" -> "functions/src_0187bbf944d724b51622cb2525998ad1.zip"
        # (27 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # google_cloudfunctions_function.submit will be updated in-place
  ~ resource "google_cloudfunctions_function" "submit" {
        id                            = "colomney-my-pet-melody-dev/asia-east1/submit"
        name                          = "submit"
      ~ source_archive_object         = "functions/src_4885636eb3880d04058b52141791bd1a.zip" -> "functions/src_0187bbf944d724b51622cb2525998ad1.zip"
        # (27 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # google_storage_bucket_object.functions_src must be replaced
-/+ resource "google_storage_bucket_object" "functions_src" {
      + content             = (sensitive value)
      ~ content_type        = "application/zip" -> (known after apply)
      ~ crc32c              = "tVz52Q==" -> (known after apply)
      ~ detect_md5hash      = "SIVjbrOIDQQFi1IUF5G9Gg==" -> "different hash" # forces replacement
      - event_based_hold    = false -> null
      ~ id                  = "colomney-my-pet-melody-dev-deploy-functions/src_4885636eb3880d04058b52141791bd1a.zip" -> (known after apply)
      + kms_key_name        = (known after apply)
      ~ md5hash             = "SIVjbrOIDQQFi1IUF5G9Gg==" -> (known after apply)
      ~ media_link          = "https://storage.googleapis.com/download/storage/v1/b/colomney-my-pet-melody-dev-deploy/o/functions%2Fsrc_4885636eb3880d04058b52141791bd1a.zip?generation=1718459264322449&alt=media" -> (known after apply)
      - metadata            = {} -> null
      ~ name                = "functions/src_4885636eb3880d04058b52141791bd1a.zip" -> "functions/src_0187bbf944d724b51622cb2525998ad1.zip" # forces replacement
      ~ output_name         = "functions/src_4885636eb3880d04058b52141791bd1a.zip" -> (known after apply)
      ~ self_link           = "https://www.googleapis.com/storage/v1/b/colomney-my-pet-melody-dev-deploy/o/functions%2Fsrc_4885636eb3880d04058b52141791bd1a.zip" -> (known after apply)
      ~ storage_class       = "STANDARD" -> (known after apply)
      - temporary_hold      = false -> null
        # (6 unchanged attributes hidden)
    }

Plan: 1 to add, 3 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```
</details>
*Pusher: @shotaIDE, Action: `pull_request`, Working Directory: ``, Workflow: `CD / Infrastructure Develop`*